if (!("a" in window)) {
    var a = 1;
}
alert(a);

эм..."a" не была объявлена,
    то alert(а), даст undefined.
        _____________________________________________________

var b = function a(x) {
    x && a(--x);
};
alert(a);
 переменная "а" не объявлена.
    предположу что alert(а), даст undefined.
    _____________________________________________________
function a(x) {
    return x * 2;
}
var a;
alert(a);
переменная "а" не объявлена.
предположу что alert(а), даст undefined.
    _____________________________________________________

function b(x, y, a) {
    arguments[2] = 10;
    alert(a);
}
b(1, 2, 3);

меняем аргумент с индексом 2, он же является аргументом "а",
    то alert(а), даст 10.
_______________________________________________________

function a() {
    alert(this);
}
a.call(null);

предположу что window